# Базовий образ. Використовується офіційний образ openjdk:21, який містить Java Development Kit
# (JDK) версії 21. Це дозволяє запускати Java-додатки без потреби встановлювати JDK вручну.
FROM openjdk:21
# Встановлення робочої директорії. Всі наступні команди будуть виконуватися в каталозі /app всередині контейнера. Якщо каталогу /app ще не існує, він буде створений автоматично.
WORKDIR /app
# Копіювання зібраного JAR-файлу.
# -- target/user-service-0.0.1-SNAPSHOT.jar - згенерований JAR-файл Spring Boot-додатка (знаходиться у директорії target після збірки за допомогою Maven).
# -- user-service.jar — ім'я файлу в контейнері (він буде збережений у /app/user-service.jar).
COPY target/user-service-0.0.1-SNAPSHOT.jar user-service.jar
# Команда для запуску додатка:
# -- CMD визначає команду, яка буде виконана під час запуску контейнера.
# -- Запускає Spring Boot-додаток за допомогою команди java -jar user-service.jar
CMD ["java", "-jar", "user-service.jar"]